<!DOCTYPE html>
<html>
<head>
  <meta charset="utf-8">
  
  <meta http-equiv="X-UA-Compatible" content="IE=edge" >
  <title>代码越多,问题也就越多 | Welee&#39;s Blog</title>
  <meta name="viewport" content="width=device-width, initial-scale=1, maximum-scale=1">
  <meta name="description" content="&amp;#x4E0B;&amp;#x9762;&amp;#x662F;&amp;#x6211;&amp;#x603B;&amp;#x7ED3;&amp;#x51FA;&amp;#x6765;&amp;#x7684;&amp;#x4E00;&amp;#x4E9B;&amp;#x89C4;&amp;#x5219;&amp;#xFF0C;&amp;#x5E76;&amp;#x4E14;&amp;#x5728;&amp;#x5B9E;&amp;#x9645;&amp;#x4E2D;&amp;#x5E94;&amp;#x8BE5;&amp;#x7262;&amp;#x8BB0;&amp;#x4E8E;">
<meta property="og:type" content="article">
<meta property="og:title" content="代码越多,问题也就越多">
<meta property="og:url" content="http://www.liduanwei.com/2016/08/06/代码越多-问题越多/index.html">
<meta property="og:site_name" content="Welee's Blog">
<meta property="og:description" content="&amp;#x4E0B;&amp;#x9762;&amp;#x662F;&amp;#x6211;&amp;#x603B;&amp;#x7ED3;&amp;#x51FA;&amp;#x6765;&amp;#x7684;&amp;#x4E00;&amp;#x4E9B;&amp;#x89C4;&amp;#x5219;&amp;#xFF0C;&amp;#x5E76;&amp;#x4E14;&amp;#x5728;&amp;#x5B9E;&amp;#x9645;&amp;#x4E2D;&amp;#x5E94;&amp;#x8BE5;&amp;#x7262;&amp;#x8BB0;&amp;#x4E8E;">
<meta property="og:updated_time" content="2016-10-13T01:23:21.957Z">
<meta name="twitter:card" content="summary">
<meta name="twitter:title" content="代码越多,问题也就越多">
<meta name="twitter:description" content="&amp;#x4E0B;&amp;#x9762;&amp;#x662F;&amp;#x6211;&amp;#x603B;&amp;#x7ED3;&amp;#x51FA;&amp;#x6765;&amp;#x7684;&amp;#x4E00;&amp;#x4E9B;&amp;#x89C4;&amp;#x5219;&amp;#xFF0C;&amp;#x5E76;&amp;#x4E14;&amp;#x5728;&amp;#x5B9E;&amp;#x9645;&amp;#x4E2D;&amp;#x5E94;&amp;#x8BE5;&amp;#x7262;&amp;#x8BB0;&amp;#x4E8E;">
  
    <link rel="alternative" href="/atom.xml" title="Welee&#39;s Blog" type="application/atom+xml">
  
  
    <link rel="icon" href="//favicon.ico">
  
  <script src="/style.js"></script>
  

</head>

<body>
  <div id="container">
    <div class="left-col">
      <div class="overlay"></div>
<div class="intrude-less">
	<header id="header" class="inner">
		<a href="/" class="profilepic">
			
			<img src="/images/avatar.png" class="js-avatar">
			
		</a>

		<hgroup>
		  <h1 class="header-author"><a href="/">Welee</a></h1>
		</hgroup>

		
		<p class="header-subtitle">欣赏生活,爱我所爱</p>
		

		<nav class="header-menu">
			<ul>
			
				<li><a href="/">主页</a></li>
	        
				<li><a href="/about">关于</a></li>
	        
			</ul>
		</nav>
		<nav class="header-smart-menu">
	        
    		
    			
    			<a class="js-smart-menu" data-idx="0" href="javascript:void(0)">所有文章</a>
    			
    			
            
    			
    			<a class="js-smart-menu" data-idx="1" href="javascript:void(0)">标签</a>
    			
    			
            
    			
    			<a class="js-smart-menu" data-idx="2" href="javascript:void(0)">友链</a>
    			
    			
            
    			
    			<a class="js-smart-menu" data-idx="3" href="javascript:void(0)">关于我</a>
    			
    			
            
		</nav>
		<nav class="header-nav">
			<div class="social">
				
					<a class="github" target="_blank" href="https://github.com/liduanwei" title="github">github</a>
		        
					<a class="weibo" target="_blank" href="http://weibo.com/u/2039275430" title="weibo">weibo</a>
		        
					<a class="rss" target="_blank" href="#" title="rss">rss</a>
		        
					<a class="mail" target="_blank" href="/liduanwei1988@gmail.com" title="mail">mail</a>
		        
					<a class="facebook" target="_blank" href="#" title="facebook">facebook</a>
		        
					<a class="google" target="_blank" href="#" title="google">google</a>
		        
					<a class="twitter" target="_blank" href="#" title="twitter">twitter</a>
		        
			</div>
		</nav>
	</header>		
</div>

    </div>
    <div class="mid-col">
      <nav id="mobile-nav">
  	<div class="overlay">
  		<div class="slider-trigger"><i class="icon-list"></i></div>
  		<h1 class="header-author js-mobile-header hide">Welee</h1>
  	</div>
	<div class="intrude-less">
		<header id="header" class="inner">
			<div class="profilepic">
				
					<img src="/images/avatar.png" class="js-avatar">
				
			</div>
			<hgroup>
			  <h1 class="header-author">Welee</h1>
			</hgroup>
			
			<p class="header-subtitle">欣赏生活,爱我所爱</p>
			
			<nav class="header-menu">
				<ul>
				
					<li><a href="/">主页</a></li>
		        
					<li><a href="/about">关于</a></li>
		        
				</ul>
			</nav>
			<nav class="header-nav">
				<div class="social">
					
						<a class="github" target="_blank" href="https://github.com/liduanwei" title="github">github</a>
			        
						<a class="weibo" target="_blank" href="http://weibo.com/u/2039275430" title="weibo">weibo</a>
			        
						<a class="rss" target="_blank" href="#" title="rss">rss</a>
			        
						<a class="mail" target="_blank" href="/liduanwei1988@gmail.com" title="mail">mail</a>
			        
						<a class="facebook" target="_blank" href="#" title="facebook">facebook</a>
			        
						<a class="google" target="_blank" href="#" title="google">google</a>
			        
						<a class="twitter" target="_blank" href="#" title="twitter">twitter</a>
			        
				</div>
			</nav>
		</header>				
	</div>
</nav>

      <div class="body-wrap">
        <article id="post-代码越多-问题越多" class="article article-type-post" itemscope itemprop="blogPost">
  <div class="article-inner">
    
      <input type="hidden" class="isFancy" />
    
    
      <header class="article-header">
        
  
    <h1 class="article-title" itemprop="name">
      代码越多,问题也就越多
    </h1>
  

      </header>
    
    <div class="article-entry" itemprop="articleBody">
      
        <p>&#x4E0B;&#x9762;&#x662F;&#x6211;&#x603B;&#x7ED3;&#x51FA;&#x6765;&#x7684;&#x4E00;&#x4E9B;&#x89C4;&#x5219;&#xFF0C;&#x5E76;&#x4E14;&#x5728;&#x5B9E;&#x9645;&#x4E2D;&#x5E94;&#x8BE5;&#x7262;&#x8BB0;&#x4E8E;&#x5FC3;&#x3002;<br>&#x5B66;&#x4E60;&#x8BED;&#x8A00;&#x800C;&#x4E0D;&#x662F;&#x6846;&#x67B6;<br>&#x6211;&#x559C;&#x6B22;Java&#x3001;PHP&#x3001;Python&#x548C;JavaScript&#xFF0C;&#x559C;&#x6B22;&#x7528;&#x4ED6;&#x4EEC;&#x505A;&#x4E9B;&#x4E1C;&#x897F;&#x3002;&#x4F46;&#x6211;&#x5374;&#x4E0D;&#x662F;Symfony&#x3001;Django&#x3001;jQuery&#x5F00;&#x53D1;&#x4EBA;&#x5458;&#x3002;<br>&#x6211;&#x8BA4;&#x4E3A;&#x8FD9;&#x6709;&#x5F88;&#x5927;&#x7684;&#x533A;&#x522B;&#x3002;&#x4E00;&#x4E2A;&#x4EBA;&#x5F88;&#x6709;&#x53EF;&#x80FD;&#x6210;&#x4E3A;&#x4E00;&#x540D;jQuery&#x7A0B;&#x5E8F;&#x5458;&#x800C;&#x975E;JavaScript&#xFF0C;&#x4E5F;&#x6709;&#x53EF;&#x80FD;&#x6210;&#x4E3A;Django&#x7A0B;&#x5E8F;&#x5458;&#x800C;&#x4E0D;&#x662F;Python&#x3002;&#x5728;&#x5B9E;&#x9645;&#x5E94;&#x7528;&#x4E2D;&#xFF0C;<br>&#x7684;&#x786E;&#x5B58;&#x5728;&#x8BB8;&#x591A;&#x6709;&#x4EF7;&#x503C;&#x4E14;&#x975E;&#x5E38;&#x5B9E;&#x7528;&#x7684;&#x5DE5;&#x5177;&#x548C;&#x6846;&#x67B6;&#xFF0C;&#x4F46;&#x5982;&#x679C;&#x6211;&#x4EC5;&#x77E5;&#x9053;&#x5982;&#x4F55;&#x4F7F;&#x7528;&#x4E00;&#x4E2A;&#x6846;&#x67B6;&#xFF0C;&#x6211;&#x60F3;&#x8868;&#x8FBE;&#x7684;&#x89C2;&#x70B9;&#x662F;&#x5728;&#x5DE5;&#x4F5C;&#x4E0A;&#x53EA;&#x4F7F;&#x7528;&#x5408;&#x9002;&#x7684;&#x5DE5;&#x5177;&#x5176;&#x5B9E;&#x4F1A;&#x7ED9;&#x4EFB;&#x52A1;&#x5E26;&#x6765;&#x4E00;&#x4E9B;&#x9650;&#x5236;&#xFF0C;&#x4F60;&#x53EF;&#x4EE5;&#x67E5;&#x770B;&#x4E00;&#x4E0B;&#xFF0C;&#x770B;&#x770B;&#x4F60;&#x7528;&#x7684;&#x5DE5;&#x5177;&#xFF0C;&#x770B;&#x770B;&#x4F60;&#x7528;&#x7684;&#x6846;&#x67B6;&#x3002;&#x4EE5;&#x6211;&#x7684;&#x7ECF;&#x9A8C;&#x6765;&#x770B;&#xFF0C;&#x4E00;&#x4E9B;&#x590D;&#x6742;&#x7684;&#x5168;&#x6808;&#xFF08;full-stack&#xFF09;&#x6846;&#x67B6;&#x5E76;&#x4E0D;&#x662F;&#x975E;&#x5E38;&#x5408;&#x9002;&#x7684;&#x5DE5;&#x5177;&#xFF0C;&#x5C24;&#x5176;&#x5728;&#x7075;&#x6D3B;&#x6027;&#x548C;&#x6027;&#x80FD;&#x65B9;&#x9762;&#x90FD;&#x4E0D;&#x662F;&#x592A;&#x597D;&#x3002;<br>&#x96C6;&#x4E2D;&#x7CBE;&#x529B;&#x5B66;&#x4E60;&#x4E00;&#x95E8;&#x8BED;&#x8A00;&#x4F1A;&#x8BA9;&#x7A0B;&#x5E8F;&#x5458;&#x53D8;&#x7684;&#x66F4;&#x52A0;&#x7075;&#x6D3B;&#x3002;&#x5168;&#x6808;&#x5F0F;&#x590D;&#x6742;&#x6846;&#x67B6;&#x53EF;&#x4EE5;&#x5E2E;&#x52A9;&#x6211;&#x5FEB;&#x901F;&#x7684;&#x6784;&#x5EFA;&#x67D0;&#x4E2A;&#x4EA7;&#x54C1;&#xFF0C;&#x4F46;&#x5F53;&#x6211;&#x9700;&#x8981;&#x4E00;&#x4E2A;&#x4E0D;&#x5C5E;&#x4E8E;&#x6846;&#x67B6;&#x8303;&#x56F4;&#x5185;&#x7684;&#x89E3;&#x51B3;&#x65B9;&#x6848;&#x65F6;&#xFF0C;&#x5B83;&#x53CD;&#x800C;&#x4F1A;&#x53D8;&#x6210;&#x4E00;&#x79CD;&#x4F24;&#x5BB3;&#x3002;&#x6211;&#x7ECF;&#x5E38;&#x4F1A;&#x91C7;&#x7528;&#x201C;plug&#x548C;pray&#x201D;&#x65B9;&#x6CD5;&#x8FDB;&#x884C;&#x5F00;&#x53D1;&#xFF0C;&#x5F53;&#x6211;&#x53D1;&#x73B0;&#x67D0;&#x4E2A;&#x5E93;&#x6216;&#x63D2;&#x4EF6;&#x53EF;&#x4EE5;&#x6EE1;&#x8DB3;&#x9700;&#x6C42;&#x65F6;&#xFF0C;&#x6211;&#x5C31;&#x4F1A;&#x628A;&#x5B83;&#x4EEC;&#x5E94;&#x7528;&#x5230;&#x4EA7;&#x54C1;&#x91CC;&#x3002;&#x8FD9;&#x6837;&#x53EF;&#x80FD;&#x4F1A;&#x4F7F;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x5FEB;&#x901F;&#x63A8;&#x51FA;&#xFF0C;&#x4F46;&#x5728;&#x4EE5;&#x540E;&#x7684;&#x9053;&#x8DEF;&#x4E0A;&#x4F1A;&#x7559;&#x4E0B;&#x5F88;&#x591A;&#x969C;&#x788D;&#x3002;<br>&#x6B64;&#x5916;&#xFF0C;&#x5B66;&#x4E60;&#x5168;&#x6808;&#x6846;&#x67B6;&#x548C;&#x5B66;&#x4E60;&#x65B0;&#x8BED;&#x8A00;&#x4E00;&#x6837;&#x590D;&#x6742;&#x3002;&#x5B83;&#x4EEC;&#x901A;&#x5E38;&#x90FD;&#x6709;&#x590D;&#x6742;&#x7684;&#x4F53;&#x7CFB;&#x7ED3;&#x6784;&#x548C;&#x672F;&#x8BED;&#xFF0C;&#x5E76;&#x4E14;&#x6709;&#x4E9B;&#x90E8;&#x5206;&#x5E76;&#x4E0D;&#x9002;&#x7528;&#x4E8E;&#x5176;&#x4ED6;&#x6846;&#x67B6;&#x548C;&#x5DE5;&#x5177;&#x4E0A;&#x3002;&#x5F53;&#x7136;&#x6846;&#x67B6;&#x4E5F;&#x6709;&#x8BB8;&#x591A;&#x597D;&#x5904;&#xFF0C;&#x4F46;&#x524D;&#x63D0;&#x662F;&#x4F60;&#x5FC5;&#x987B;&#x8981;&#x61C2;&#x8FD9;&#x95E8;&#x8BED;&#x8A00;&#xFF0C;&#x7136;&#x540E;&#x624D;&#x80FD;&#x7406;&#x89E3;&#x5176;&#x771F;&#x6B63;&#x7684;&#x5DE5;&#x4F5C;&#x539F;&#x7406;&#xFF0C;&#x6240;&#x4EE5;&#x6211;&#x5B81;&#x613F;&#x82B1;&#x65F6;&#x95F4;&#x5B66;&#x4E60;&#x66F4;&#x591A;&#x5173;&#x4E8E;&#x8BED;&#x8A00;&#x672C;&#x8EAB;&#x7684;&#x4E1C;&#x897F;&#xFF0C;&#x5E76;&#x4E14;&#x628A;&#x6240;&#x5B66;&#x7684;&#x6280;&#x80FD;&#x5E94;&#x7528;&#x5230;&#x5176;&#x4ED6;&#x8BED;&#x8A00;&#x6216;&#x8005;&#x5E93;&#x4E0A;&#x3002;<br>&#x6784;&#x5EFA;&#x5C0F;&#x6A21;&#x5757;<br>&#x6709;&#x4E9B;&#x5C0F;&#x578B;&#x7684;&#x5355;&#x5143;&#x4EE3;&#x7801;&#x662F;&#x5F88;&#x597D;&#x5F88;&#x8BA8;&#x7A0B;&#x5E8F;&#x5458;&#x4EEC;&#x559C;&#x6B22;&#x7684;&#xFF0C;&#x56E0;&#x4E3A;&#x8D8A;&#x5C0F;&#x8D8A;&#x5BB9;&#x6613;&#x7406;&#x89E3;&#x4E14;&#x5F88;&#x96BE;&#x628A;&#x5B83;&#x5F04;&#x7684;&#x5F88;&#x7CDF;&#xFF0C;&#x6240;&#x4EE5;&#x9650;&#x5236;&#x7F16;&#x5199;&#x5197;&#x957F;&#x590D;&#x6742;&#x7684;&#x4EE3;&#x7801;&#x662F;&#x975E;&#x5E38;&#x91CD;&#x8981;&#x7684;&#x3002;<br>&#x6240;&#x4EE5;&#x6709;&#x76EE;&#x7684;&#x7684;&#x6784;&#x5EFA;&#x4E00;&#x4E9B;&#x5C0F;&#x6A21;&#x5757;&#x2014;&#x2014;&#x5C3D;&#x53EF;&#x80FD;&#x7684;&#x63A5;&#x8FD1;&#x9700;&#x6C42;&#x76EE;&#x6807;&#x3002;&#x5B83;&#x4EEC;&#x5E94;&#x8BE5;&#x662F;&#x72EC;&#x7ACB;&#x7684;&#x5757;&#xFF0C;&#x5355;&#x7EAF;&#x5730;&#x89E3;&#x51B3;&#x67D0;&#x65B9;&#x9762;&#x95EE;&#x9898;&#xFF0C;&#x4F46;&#x662F;&#x628A;&#x5B83;&#x4EEC;&#x7ED3;&#x5408;&#x8D77;&#x6765;&#x65F6;&#xFF0C;&#x5C31;&#x53EF;&#x4EE5;&#x89E3;&#x51B3;&#x8BB8;&#x591A;&#x5927;&#x578B;&#x7684;&#x3001;&#x590D;&#x6742;&#x7684;&#x95EE;&#x9898;&#x3002;<br>&#x50CF;&#x8FD9;&#x4E9B;&#x7B80;&#x5355;&#x7684;&#x6A21;&#x5757;&#x4EE3;&#x7801;&#x4FEE;&#x590D;&#x8D77;bug&#x6765;&#x4E5F;&#x4F1A;&#x975E;&#x5E38;&#x5BB9;&#x6613;&#x3002;&#x56E0;&#x4E3A;&#x8FD9;&#x4E9B;&#x5355;&#x72EC;&#x7684;&#x5757;&#x901A;&#x4FD7;&#x6613;&#x61C2;&#xFF0C;&#x4E00;&#x770B;&#x5C31;&#x4F1A;&#x77E5;&#x9053;&#x5176;&#x7528;&#x9014;&#x3002;&#x5982;&#x679C;&#x6A21;&#x5757;&#x662F;&#x81EA;&#x6211;&#x5305;&#x542B;&#x7684;&#xFF0C;&#x90A3;&#x4E48;&#x6D4B;&#x8BD5;&#x8D77;&#x6765;&#x4F1A;&#x66F4;&#x52A0;&#x7B80;&#x5355;&#x3002;<br>&#x4EE3;&#x7801;&#x8D8A;&#x5C11;&#x8D8A;&#x597D;<br>&#x5957;&#x7528;Biggie Smalls&#x7684;&#x4E00;&#x53E5;&#x8BDD;&#xFF1A;&#x201C;&#x4EE3;&#x7801;&#x8D8A;&#x591A;&#xFF0C;&#x95EE;&#x9898;&#x4E5F;&#x5C31;&#x8D8A;&#x591A;&#x201D;&#x3002;<br>&#x8C01;&#x90FD;&#x559C;&#x6B22;&#x7BA1;&#x7406;&#x5C11;&#x7684;&#x4EE3;&#x7801;&#x3002;&#x4F30;&#x8BA1;&#x5927;&#x5BB6;&#x90FD;&#x6709;&#x8FC7;&#x8FD9;&#x6837;&#x7684;&#x4F53;&#x4F1A;&#xFF0C;&#x5F53;&#x5BA1;&#x67E5;&#x4E00;&#x4E2A;&#x529F;&#x80FD;&#x6A21;&#x5757;&#x7684;&#x4EE3;&#x7801;&#x65F6;&#xFF0C;&#x5982;&#x679C;&#x4EE3;&#x7801;&#x5F88;&#x591A;&#x5F88;&#x4E71;&#xFF0C;&#x7B2C;&#x4E00;&#x5370;&#x8C61;&#x80AF;&#x5B9A;&#x4E0D;&#x597D;&#xFF0C;&#x76F8;&#x53CD;&#xFF0C;&#x5982;&#x679C;&#x8BE5;&#x6A21;&#x5757;&#x4EE3;&#x7801;&#x7B80;&#x6D01;&#x660E;&#x4E86;&#xFF0C;&#x4F60;&#x4F1A;&#x975E;&#x5E38;&#x6109;&#x60A6;&#x3002;&#x66F4;&#x901A;&#x4FD7;&#x70B9;&#x8BB2;&#x5C31;&#x662F;&#x4EE3;&#x7801;&#x8D8A;&#x591A;&#xFF0C;&#x7BA1;&#x7406;&#x8D77;&#x6765;&#x4E5F;&#x5C31;&#x8D8A;&#x56F0;&#x96BE;&#xFF1A;&#x641C;&#x7D22;&#x4EE3;&#x7801;&#x5E93;&#x7684;&#x65F6;&#x95F4;&#x4F1A;&#x53D8;&#x957F;&#x3001;&#x67E5;&#x770B;&#x6587;&#x4EF6;&#x5BFC;&#x822A;&#x4E5F;&#x9700;&#x8981;&#x8F83;&#x957F;&#x7684;&#x65F6;&#x95F4;&#x3001;&#x8DDF;&#x8E2A;&#x6267;&#x884C;&#x4E5F;&#x4F1A;&#x53D8;&#x7684;&#x56F0;&#x96BE;&#x7B49;&#x3002;<br>&#x4F60;&#x662F;&#x5426;&#x53D1;&#x73B0;&#xFF0C;&#x4EE3;&#x7801;&#x5BA1;&#x67E5;&#x3001;&#x8FD8;&#x6709;&#x4F60;&#x4F7F;&#x7528;&#x7684;&#x5DE5;&#x5177;&#xFF0C;&#x5F88;&#x5927;&#x7A0B;&#x5EA6;&#x4E0A;&#x90FD;&#x662F;&#x7528;&#x6765;&#x51CF;&#x5C11;&#x4EE3;&#x7801;&#x91CF;&#x7684;&#x3002;&#x90A3;&#x4E9B;&#x5E9E;&#x5927;&#x7684;&#x5E93;&#x548C;&#x957F;&#x4EE3;&#x7801;&#x4F3C;&#x4E4E;&#x4F1A;&#x6EA2;&#x51FA;&#x4EBA;&#x4EEC;&#x7684;&#x5927;&#x8111;&#x7F13;&#x51B2;&#x533A;&#x3002;&#x5F53;&#x6211;&#x5728;&#x8FFD;&#x8E2A;&#x4E00;&#x6BB5;&#x8F83;&#x957F;&#x7684;&#x6E90;&#x7801;&#x6216;&#x6267;&#x884C;&#x8DF3;&#x8DC3;&#x597D;&#x51E0;&#x4E2A;&#x6E90;&#x6587;&#x4EF6;&#x7684;&#x529F;&#x80FD;&#x65F6;&#xFF0C;&#x6211;&#x4F1A;&#x611F;&#x5230;&#x5F88;&#x82E6;&#x607C;&#x3002;&#x8FD9;&#x5C31;&#x662F;&#x4E3A;&#x4EC0;&#x4E48;&#x6211;&#x4F1A;&#x559C;&#x6B22;&#x7ED9;&#x8BED;&#x6CD5;&#x8FDB;&#x884C;&#x7740;&#x8272;&#x7684;&#x7F16;&#x8F91;&#x5668;&#xFF0C;&#x5E76;&#x4E14;&#x4FDD;&#x6301;&#x4E00;&#x81F4;&#x7684;&#x7A7A;&#x683C;&#x5BF9;&#x6211;&#x4E5F;&#x975E;&#x5E38;&#x6709;&#x5E2E;&#x52A9;&#x3002;<br>&#x9664;&#x4E86;&#x559C;&#x6B22;&#x7BA1;&#x7406;&#x8F83;&#x5C11;&#x7684;&#x4EE3;&#x7801;&#x5916;&#xFF0C;&#x6211;&#x8FD8;&#x652F;&#x6301;&#x5F00;&#x53D1;&#x8005;&#x4EEC;&#x5C3D;&#x91CF;&#x7B80;&#x5316;&#x4EE3;&#x7801;&#x3002;&#x7A0B;&#x5E8F;&#x5458;&#x8981;&#x4E3A;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x6240;&#x4F7F;&#x7528;&#x7684;&#x4EE3;&#x7801;&#xFF0C;&#x4E0D;&#x4EC5;&#x4EC5;&#x662F;&#x81EA;&#x5DF1;&#x7F16;&#x5199;&#x7684;&#x90E8;&#x5206;&#x8D1F;&#x8D23;&#x2014;&#x2014;&#x751A;&#x81F3;&#x662F;&#x8FD9;&#x4E9B;&#x5E94;&#x7528;&#x91CC;&#x7684;&#x6BCF;&#x884C;&#x4EE3;&#x7801;&#x3002;&#x8FD9;&#x4E5F;&#x5C31;&#x610F;&#x5473;&#x7740;&#x8981;&#x66FF;&#x8FD9;&#x4E9B;&#x5E94;&#x7528;&#x91CC;&#x51FA;&#x73B0;&#x7684;bug&#x6216;&#x8005;&#x5B89;&#x5168;&#x6F0F;&#x6D1E;&#x8D1F;&#x8D23;&#x3002;</p>
<p>&#x4F60;&#x4F1A;&#x5728;&#x7A0B;&#x5E8F;&#x4E2D;&#x4F7F;&#x7528;&#x81EA;&#x5DF1;&#x4E0D;&#x7406;&#x89E3;&#x7684;&#x4EE3;&#x7801;&#x5417;&#xFF1F;&#x8FD9;&#x5E76;&#x4E0D;&#x8868;&#x793A;&#x6211;&#x4ECE;&#x4E0D;&#x4F7F;&#x7528;&#x4ED6;&#x4EBA;&#x7684;&#x4EE3;&#x7801;&#x2014;&#x2014;&#x5766;&#x767D;&#x8BF4;&#xFF0C;&#x4E16;&#x4E0A;&#x6709;&#x8BB8;&#x591A;&#x4F18;&#x79C0;&#x7684;&#x7A0B;&#x5E8F;&#x5458;&#xFF0C;&#x4F46;&#x662F;&#x5728;&#x5E94;&#x7528;&#x4ED6;&#x4EBA;&#x4EE3;&#x7801;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x4F60;&#x5FC5;&#x987B;&#x7406;&#x89E3;&#x4EE3;&#x7801;&#xFF0C;&#x56E0;&#x4E3A;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x91CC;&#x7684;&#x6BCF;&#x884C;&#x4EE3;&#x7801;&#x90FD;&#x5F88;&#x91CD;&#x8981;&#x3002;&#x5728;&#x7F16;&#x7801;&#x65F6;&#x5343;&#x4E07;&#x4E0D;&#x8981;&#x5FD8;&#x8BB0;&#x601D;&#x8003;&#xFF0C;&#x7F16;&#x5199;&#x6700;&#x5C11;&#x4EE3;&#x7801;&#x7684;&#x80CC;&#x540E;&#x5E94;&#x8BE5;&#x662F;&#x591A;&#x601D;&#x8003;&#xFF0C;&#x8FD9;&#x6837;&#x5C31;&#x4E0D;&#x4F1A;&#x7ED9;&#x81EA;&#x5DF1;&#x5E26;&#x6765;&#x4E0D;&#x5FC5;&#x8981;&#x7684;&#x9EBB;&#x70E6;&#x3002;<br>&#x7F16;&#x5199;&#x7B80;&#x5355;&#x3001;&#x6709;&#x7528;&#x53EF;&#x8BFB;&#x7684;&#x4EE3;&#x7801;<br>&#x7F16;&#x5199;&#x5BB9;&#x6613;&#x7406;&#x89E3;&#x7684;&#x4EE3;&#x7801;&#xFF0C;&#x5C11;&#x7F16;&#x7801;&#x591A;&#x601D;&#x8003;&#xFF0C;&#x8FD9;&#x6837;&#x5B8C;&#x6210;&#x4E00;&#x4E2A;&#x529F;&#x80FD;&#x5C31;&#x4F1A;&#x5F88;&#x5FEB;&#xFF0C;&#x751F;&#x4EA7;&#x529B;&#x5C31;&#x4F1A;&#x5F97;&#x5230;&#x63D0;&#x9AD8;&#x3002;<br>&#x5F53;&#x7136;&#xFF0C;&#x6211;&#x4E5F;&#x5E0C;&#x671B;&#x4EE3;&#x7801;&#x662F;&#x53EF;&#x9A8C;&#x8BC1;&#x7684;&#x3002;&#x5E76;&#x4E14;&#x6211;&#x4E00;&#x76F4;&#x8BA4;&#x4E3A;&#x7B80;&#x5355;&#x3001;&#x6A21;&#x5757;&#x5316;&#x7684;&#x4EE3;&#x7801;&#x662F;&#x66F4;&#x5BB9;&#x6613;&#x88AB;&#x6D4B;&#x8BD5;&#x3002;<br>&#x4EE3;&#x7801;&#x5E94;&#x5177;&#x5907;&#x7684;&#x53E6;&#x4E00;&#x7279;&#x5F81;&#x5C31;&#x662F;&#x53EF;&#x8BFB;&#x3002;&#x4EE3;&#x7801;&#x5E94;&#x7B80;&#x6D01;&#x660E;&#x4E86;&#xFF0C;&#x8BED;&#x4E49;&#x6E05;&#x695A;&#x3002;&#x5728;&#x7F16;&#x5199;&#x4EE3;&#x7801;&#x65F6;&#xFF0C;&#x6211;&#x4F1A;&#x601D;&#x8003;&#x5176;&#x4ED6;&#x7A0B;&#x5E8F;&#x5458;&#x5728;&#x7B2C;&#x4E00;&#x773C;&#x770B;&#x5230;&#x5B83;&#x7684;&#x65F6;&#x5019;&#x4F1A;&#x82B1;&#x591A;&#x957F;&#x65F6;&#x95F4;&#x6765;&#x7406;&#x89E3;&#x3002;&#x6216;&#x8005;&#x4E00;&#x4E24;&#x4E2A;&#x6708;&#x540E;&#x6211;&#x81EA;&#x5DF1;&#x80FD;&#x4E00;&#x76EE;&#x4E86;&#x7136;&#x5417;&#xFF1F;&#x6B63;&#x5982;&#x5927;&#x5BB6;&#x719F;&#x77E5;&#x7684;&#x90A3;&#x53E5;&#x7F16;&#x7A0B;&#x8C1A;&#x8BED;&#xFF1A;&#x4EFB;&#x4F55;&#x4E00;&#x4E2A;&#x50BB;&#x74DC;&#x90FD;&#x4F1A;&#x5199;&#x51FA;&#x80FD;&#x591F;&#x8BA9;&#x673A;&#x5668;&#x7406;&#x89E3;&#x7684;&#x4EE3;&#x7801;&#xFF0C;&#x53EA;&#x6709;&#x597D;&#x7684;&#x7A0B;&#x5E8F;&#x5458;&#x624D;&#x80FD;&#x5199;&#x51FA;&#x4EBA;&#x7C7B;&#x53EF;&#x4EE5;&#x7406;&#x89E3;&#x7684;&#x4EE3;&#x7801;&#x3002;&#x5F53;&#x6211;&#x8BD5;&#x56FE;&#x53D1;&#x73B0;&#x5B83;&#x4EEC;&#x5DE5;&#x4F5C;&#x539F;&#x7406;&#x7684;&#x65F6;&#x95F4;&#x8D8A;&#x5C11;&#xFF0C;&#x505A;&#x7684;&#x4E8B;&#x60C5;&#x5C31;&#x4F1A;&#x8D8A;&#x591A;&#x3002;<br>&#x4F46;&#x662F;&#x5F88;&#x5C11;&#x6709;&#x4EBA;&#x80FD;&#x575A;&#x6301;&#x8FD9;&#x4E9B;&#x89C4;&#x5219;&#xFF0C;&#x5982;&#x679C;&#x6211;&#x8BF4;&#x662F;&#xFF0C;&#x90A3;&#x4E48;&#x6211;&#x80AF;&#x5B9A;&#x662F;&#x5728;&#x6492;&#x8C0E;&#x3002;&#x6709;&#x65F6;&#x5019;&#x6211;&#x4E5F;&#x4F1A;&#x5F88;&#x61D2;&#x60F0;&#xFF0C;&#x751A;&#x81F3;&#x7531;&#x4E8E;&#x65F6;&#x95F4;&#x9650;&#x5236;&#xFF0C;&#x6211;&#x4F1A;&#x7F16;&#x5199;&#x4E00;&#x4E9B;&#x590D;&#x6742;&#x7684;&#x3001;&#x96BE;&#x4EE5;&#x7406;&#x89E3;&#x7684;&#x4EE3;&#x7801;&#x6216;&#x8005;&#x4F7F;&#x7528;&#x6CA1;&#x6709;&#x5BA1;&#x67E5;&#x7684;&#x5E93;&#x6765;&#x5B9E;&#x73B0;&#x67D0;&#x4E2A;&#x529F;&#x80FD;&#x3002;&#x60F3;&#x8981;&#x5728;&#x77ED;&#x671F;&#x5185;&#x7F16;&#x5199;&#x7B80;&#x5355;&#x3001;&#x6E05;&#x6670;&#x7684;&#x4EE3;&#x7801;&#x4F1A;&#x5F88;&#x56F0;&#x96BE;&#x2014;&#x2014;&#x5B83;&#x9700;&#x8981;&#x66F4;&#x591A;&#x7684;&#x7EAA;&#x5F8B;&#x548C;&#x4E0D;&#x65AD;&#x7684;&#x6280;&#x672F;&#x8BC4;&#x4F30;&#x3002;&#x7279;&#x522B;&#x662F;&#x90A3;&#x79CD;&#x5BF9;&#x65F6;&#x95F4;&#x654F;&#x611F;&#x7684;&#x9879;&#x76EE;&#xFF0C;&#x5B9E;&#x884C;&#x8D77;&#x6765;&#x5C06;&#x4F1A;&#x66F4;&#x96BE;&#x3002;<br>&#x4F46;&#x662F;&#xFF0C;&#x5F53;&#x4F60;&#x82B1;&#x65F6;&#x95F4;&#x548C;&#x7CBE;&#x529B;&#x53BB;&#x505A;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x4F60;&#x4F1A;&#x53D1;&#x73B0;&#x529F;&#x592B;&#x4E0D;&#x8D1F;&#x6709;&#x5FC3;&#x4EBA;&#x2014;&#x2014;&#x4E0D;&#x4EC5;&#x4EC5;&#x5BF9;&#x81EA;&#x5DF1;&#x6709;&#x5E2E;&#x52A9;&#xFF0C;&#x8FD8;&#x4F1A;&#x7ED9;&#x5176;&#x4ED6;&#x56E2;&#x961F;&#x6210;&#x5458;&#x5E26;&#x6765;&#x5F88;&#x591A;&#x76CA;&#x5904;&#x3002;</p>

      
    </div>
    <div class="article-info article-info-index">
      
      <a href="/2016/08/06/代码越多-问题越多/" class="archive-article-date">
  	<time datetime="2016-08-06T01:59:31.000Z" itemprop="datePublished"><i class="icon-clock"></i>2016-08-06</time>
</a>
      
	<div class="article-tag tagcloud">
		<i class="icon-price-tags"></i>
		<ul class="article-tag-list"><li class="article-tag-list-item"><a class="article-tag-list-link" href="/tags/感悟/">感悟</a></li><li class="article-tag-list-item"><a class="article-tag-list-link" href="/tags/感想/">感想</a></li></ul>
	</div>

      

      <div class="clearfix"></div>
    </div>
  </div>
</article>

  
<nav id="article-nav">
  
    <a href="/2016/08/17/Java动态生成字节码并加载/" id="article-nav-newer" class="article-nav-link-wrap">
      <i class="icon-circle-left"></i>
      <div class="article-nav-title">
        
          Java动态生成字节码并加载
        
      </div>
    </a>
  
  
</nav>




<div class="share_jia">
	<!-- JiaThis Button BEGIN -->
	<div class="jiathis_style">
		<span class="jiathis_txt">Share to: &nbsp; </span>
		<a class="jiathis_button_facebook"></a> 
	    <a class="jiathis_button_twitter"></a>
	    <a class="jiathis_button_plus"></a> 
	    <a class="jiathis_button_tsina"></a>
		<a class="jiathis_button_cqq"></a>
		<a class="jiathis_button_douban"></a>
		<a class="jiathis_button_weixin"></a>
		<a class="jiathis_button_tumblr"></a>
    <a href="http://www.jiathis.com/share" class="jiathis jiathis_txt jtico jtico_jiathis" target="_blank"></a>
	</div>
	<script type="text/javascript" src="//v3.jiathis.com/code/jia.js?uid=1405949716054953" charset="utf-8"></script>
	<!-- JiaThis Button END -->
</div>






<div class="duoshuo">
	<!-- 多说评论框 start -->
	<div class="ds-thread" data-thread-key="代码越多-问题越多" data-title="代码越多,问题也就越多" data-url="http://www.liduanwei.com/2016/08/06/代码越多-问题越多/"></div>
	<!-- 多说评论框 end -->
	<!-- 多说公共JS代码 start (一个网页只需插入一次) -->
	<script type="text/javascript">
	var duoshuoQuery = {short_name:"liduanwei"};
	(function() {
		var ds = document.createElement('script');
		ds.type = 'text/javascript';ds.async = true;
		ds.src = (document.location.protocol == 'https:' ? 'https:' : 'http:') + '//static.duoshuo.com/embed.js';
		ds.charset = 'UTF-8';
		(document.getElementsByTagName('head')[0] 
		 || document.getElementsByTagName('body')[0]).appendChild(ds);
	})();
	</script>
	<!-- 多说公共JS代码 end -->
</div>





      </div>
      <footer id="footer">
  <div class="outer">
    <div id="footer-info">
    	<div class="footer-left">
    		&copy; 2016 Welee
    	</div>
      	<div class="footer-right">
      		<a href="http://hexo.io/" target="_blank">Hexo</a>  Theme <a href="https://github.com/litten/hexo-theme-yilia" target="_blank">Yilia</a> by Litten
      	</div>
    </div>
  </div>
</footer>
    </div>
    <script>
	var yiliaConfig = {
		fancybox: true,
		mathjax: false,
		animate: true,
		isHome: false,
		isPost: true,
		isArchive: false,
		isTag: false,
		isCategory: false,
		open_in_new: false,
		root: "/",
		innerArchive: true
	}
</script>

<script src="/./main.js"></script>


    
<div class="tools-col">
  <ul class="btn-wrap">
    
      <li class="chose" data-hook="tools-section-all"><span class="text">全部</span><i class="icon-book"></i></li>
    
    
      <li data-hook="tools-section-tag"><span class="text">标签</span><i class="icon-price-tags"></i></li>
    
    
      <li data-hook="tools-section-friends"><span class="text">友链</span><i class="icon-link"></i></li>
    
    
      <li data-hook="tools-section-me"><span class="text">我</span><i class="icon-smile"></i></li>
    
  </ul>
  <div class="tools-wrap">
    
    	<section class="tools-section tools-section-all chose">
    	</section>
    

    
    	<section class="tools-section tools-section-tag">
    			<div class="widget tagcloud" id="js-tagcloud">
    				<a href="/tags/Compiler/" style="font-size: 10px;">Compiler</a> <a href="/tags/Dubbo/" style="font-size: 10px;">Dubbo</a> <a href="/tags/Java/" style="font-size: 20px;">Java</a> <a href="/tags/Javaassit/" style="font-size: 10px;">Javaassit</a> <a href="/tags/MVVM/" style="font-size: 10px;">MVVM</a> <a href="/tags/Nginx/" style="font-size: 15px;">Nginx</a> <a href="/tags/ORM/" style="font-size: 10px;">ORM</a> <a href="/tags/Spring/" style="font-size: 10px;">Spring</a> <a href="/tags/SpringMVC/" style="font-size: 10px;">SpringMVC</a> <a href="/tags/Tengine/" style="font-size: 10px;">Tengine</a> <a href="/tags/Tomcat/" style="font-size: 10px;">Tomcat</a> <a href="/tags/Web/" style="font-size: 10px;">Web</a> <a href="/tags/Zookeeper/" style="font-size: 10px;">Zookeeper</a> <a href="/tags/error/" style="font-size: 10px;">error</a> <a href="/tags/git/" style="font-size: 15px;">git</a> <a href="/tags/hook/" style="font-size: 10px;">hook</a> <a href="/tags/hooks/" style="font-size: 10px;">hooks</a> <a href="/tags/post-receive/" style="font-size: 10px;">post-receive</a> <a href="/tags/post-update/" style="font-size: 10px;">post-update</a> <a href="/tags/web框架/" style="font-size: 10px;">web框架</a> <a href="/tags/分布式/" style="font-size: 15px;">分布式</a> <a href="/tags/前端/" style="font-size: 10px;">前端</a> <a href="/tags/动态代理/" style="font-size: 10px;">动态代理</a> <a href="/tags/原理/" style="font-size: 10px;">原理</a> <a href="/tags/双向绑定/" style="font-size: 10px;">双向绑定</a> <a href="/tags/反向代理/" style="font-size: 10px;">反向代理</a> <a href="/tags/字节码/" style="font-size: 10px;">字节码</a> <a href="/tags/安全/" style="font-size: 10px;">安全</a> <a href="/tags/常见问题/" style="font-size: 10px;">常见问题</a> <a href="/tags/开发书籍/" style="font-size: 10px;">开发书籍</a> <a href="/tags/开发工具/" style="font-size: 10px;">开发工具</a> <a href="/tags/开源项目/" style="font-size: 10px;">开源项目</a> <a href="/tags/感悟/" style="font-size: 15px;">感悟</a> <a href="/tags/感情/" style="font-size: 10px;">感情</a> <a href="/tags/感想/" style="font-size: 10px;">感想</a> <a href="/tags/服务器端/" style="font-size: 10px;">服务器端</a> <a href="/tags/机器学习/" style="font-size: 10px;">机器学习</a> <a href="/tags/框架/" style="font-size: 10px;">框架</a> <a href="/tags/源码/" style="font-size: 10px;">源码</a> <a href="/tags/生日/" style="font-size: 10px;">生日</a> <a href="/tags/生活/" style="font-size: 10px;">生活</a> <a href="/tags/编译器/" style="font-size: 10px;">编译器</a> <a href="/tags/自动部署/" style="font-size: 10px;">自动部署</a> <a href="/tags/负载均衡/" style="font-size: 10px;">负载均衡</a> <a href="/tags/随笔/" style="font-size: 10px;">随笔</a>
    			</div>
    	</section>
    

    
    	<section class="tools-section tools-section-friends">
  		
  			<div class="friends-wrap" id="js-friends">
  			
  	          <a target="_blank" class="main-nav-link switch-friends-link" href="http://blog.liduanwei.com">Welee&#39;s Blog</a>
  	        
  	        </div>
  		
    	</section>
    

    
    	<section class="tools-section tools-section-me">
  	  	
  	  		<div class="aboutme-wrap" id="js-aboutme">爱码代码,也折腾好玩的智能硬件,希望能做点什么出来影响这个世界…</div>
  	  	
    	</section>
    
  </div>
  
</div>
    <!-- Root element of PhotoSwipe. Must have class pswp. -->
<div class="pswp" tabindex="-1" role="dialog" aria-hidden="true">

    <!-- Background of PhotoSwipe. 
         It's a separate element as animating opacity is faster than rgba(). -->
    <div class="pswp__bg"></div>

    <!-- Slides wrapper with overflow:hidden. -->
    <div class="pswp__scroll-wrap">

        <!-- Container that holds slides. 
            PhotoSwipe keeps only 3 of them in the DOM to save memory.
            Don't modify these 3 pswp__item elements, data is added later on. -->
        <div class="pswp__container">
            <div class="pswp__item"></div>
            <div class="pswp__item"></div>
            <div class="pswp__item"></div>
        </div>

        <!-- Default (PhotoSwipeUI_Default) interface on top of sliding area. Can be changed. -->
        <div class="pswp__ui pswp__ui--hidden">

            <div class="pswp__top-bar">

                <!--  Controls are self-explanatory. Order can be changed. -->

                <div class="pswp__counter"></div>

                <button class="pswp__button pswp__button--close" title="Close (Esc)"></button>

                <button class="pswp__button pswp__button--share" style="display:none" title="Share"></button>

                <button class="pswp__button pswp__button--fs" title="Toggle fullscreen"></button>

                <button class="pswp__button pswp__button--zoom" title="Zoom in/out"></button>

                <!-- Preloader demo http://codepen.io/dimsemenov/pen/yyBWoR -->
                <!-- element will get class pswp__preloader--active when preloader is running -->
                <div class="pswp__preloader">
                    <div class="pswp__preloader__icn">
                      <div class="pswp__preloader__cut">
                        <div class="pswp__preloader__donut"></div>
                      </div>
                    </div>
                </div>
            </div>

            <div class="pswp__share-modal pswp__share-modal--hidden pswp__single-tap">
                <div class="pswp__share-tooltip"></div> 
            </div>

            <button class="pswp__button pswp__button--arrow--left" title="Previous (arrow left)">
            </button>

            <button class="pswp__button pswp__button--arrow--right" title="Next (arrow right)">
            </button>

            <div class="pswp__caption">
                <div class="pswp__caption__center"></div>
            </div>

        </div>

    </div>

</div>
  </div>
</body>
</html>