<!DOCTYPE html>
<html>
<head>
  <meta charset="utf-8">
  
  <meta http-equiv="X-UA-Compatible" content="IE=edge" >
  <title>技术总监和CTO的区别 浅谈CTO的作用 | Welee&#39;s Blog</title>
  <meta name="viewport" content="width=device-width, initial-scale=1, maximum-scale=1">
  <meta name="description" content="&amp;#x6211;&amp;#x4E00;&amp;#x76F4;&amp;#x5728;&amp;#x601D;&amp;#x8003;&amp;#x8F6F;&amp;#x4EF6;&amp;#x516C;&amp;#x53F8;&amp;#x5982;&amp;#x4F55;&amp;#x5F00;&amp;#x6E90;&amp;#x8282;&amp;#x6D41;&amp;#x3002;
&amp;#x5F53;&amp;#x7136;&amp;#xFF0C;&amp;#x8001;&amp;#x677F;&amp;#x4E5F;&amp;#x5728;&amp;#x601D">
<meta property="og:type" content="article">
<meta property="og:title" content="技术总监和CTO的区别 浅谈CTO的作用">
<meta property="og:url" content="http://www.liduanwei.com/2016/11/01/技术总监和CTO的区别-浅谈CTO的作用/index.html">
<meta property="og:site_name" content="Welee's Blog">
<meta property="og:description" content="&amp;#x6211;&amp;#x4E00;&amp;#x76F4;&amp;#x5728;&amp;#x601D;&amp;#x8003;&amp;#x8F6F;&amp;#x4EF6;&amp;#x516C;&amp;#x53F8;&amp;#x5982;&amp;#x4F55;&amp;#x5F00;&amp;#x6E90;&amp;#x8282;&amp;#x6D41;&amp;#x3002;
&amp;#x5F53;&amp;#x7136;&amp;#xFF0C;&amp;#x8001;&amp;#x677F;&amp;#x4E5F;&amp;#x5728;&amp;#x601D">
<meta property="og:updated_time" content="2016-11-01T08:51:06.000Z">
<meta name="twitter:card" content="summary">
<meta name="twitter:title" content="技术总监和CTO的区别 浅谈CTO的作用">
<meta name="twitter:description" content="&amp;#x6211;&amp;#x4E00;&amp;#x76F4;&amp;#x5728;&amp;#x601D;&amp;#x8003;&amp;#x8F6F;&amp;#x4EF6;&amp;#x516C;&amp;#x53F8;&amp;#x5982;&amp;#x4F55;&amp;#x5F00;&amp;#x6E90;&amp;#x8282;&amp;#x6D41;&amp;#x3002;
&amp;#x5F53;&amp;#x7136;&amp;#xFF0C;&amp;#x8001;&amp;#x677F;&amp;#x4E5F;&amp;#x5728;&amp;#x601D">
  
    <link rel="alternative" href="/atom.xml" title="Welee&#39;s Blog" type="application/atom+xml">
  
  
    <link rel="icon" href="//favicon.ico">
  
  <script src="/style.js"></script>
  

</head>

<body>
  <div id="container">
    <div class="left-col">
      <div class="overlay"></div>
<div class="intrude-less">
	<header id="header" class="inner">
		<a href="/" class="profilepic">
			
			<img src="/images/avatar.png" class="js-avatar">
			
		</a>

		<hgroup>
		  <h1 class="header-author"><a href="/">Welee</a></h1>
		</hgroup>

		
		<p class="header-subtitle">欣赏生活,爱我所爱</p>
		

		<nav class="header-menu">
			<ul>
			
				<li><a href="/">主页</a></li>
	        
				<li><a href="/about">关于</a></li>
	        
			</ul>
		</nav>
		<nav class="header-smart-menu">
	        
    		
    			
    			<a class="js-smart-menu" data-idx="0" href="javascript:void(0)">所有文章</a>
    			
    			
            
    			
    			<a class="js-smart-menu" data-idx="1" href="javascript:void(0)">标签</a>
    			
    			
            
    			
    			<a class="js-smart-menu" data-idx="2" href="javascript:void(0)">友链</a>
    			
    			
            
    			
    			<a class="js-smart-menu" data-idx="3" href="javascript:void(0)">关于我</a>
    			
    			
            
		</nav>
		<nav class="header-nav">
			<div class="social">
				
					<a class="github" target="_blank" href="https://github.com/liduanwei" title="github">github</a>
		        
					<a class="weibo" target="_blank" href="http://weibo.com/u/2039275430" title="weibo">weibo</a>
		        
					<a class="rss" target="_blank" href="#" title="rss">rss</a>
		        
					<a class="mail" target="_blank" href="/liduanwei1988@gmail.com" title="mail">mail</a>
		        
					<a class="facebook" target="_blank" href="#" title="facebook">facebook</a>
		        
					<a class="google" target="_blank" href="#" title="google">google</a>
		        
					<a class="twitter" target="_blank" href="#" title="twitter">twitter</a>
		        
			</div>
		</nav>
	</header>		
</div>

    </div>
    <div class="mid-col">
      <nav id="mobile-nav">
  	<div class="overlay">
  		<div class="slider-trigger"><i class="icon-list"></i></div>
  		<h1 class="header-author js-mobile-header hide">Welee</h1>
  	</div>
	<div class="intrude-less">
		<header id="header" class="inner">
			<div class="profilepic">
				
					<img src="/images/avatar.png" class="js-avatar">
				
			</div>
			<hgroup>
			  <h1 class="header-author">Welee</h1>
			</hgroup>
			
			<p class="header-subtitle">欣赏生活,爱我所爱</p>
			
			<nav class="header-menu">
				<ul>
				
					<li><a href="/">主页</a></li>
		        
					<li><a href="/about">关于</a></li>
		        
				</ul>
			</nav>
			<nav class="header-nav">
				<div class="social">
					
						<a class="github" target="_blank" href="https://github.com/liduanwei" title="github">github</a>
			        
						<a class="weibo" target="_blank" href="http://weibo.com/u/2039275430" title="weibo">weibo</a>
			        
						<a class="rss" target="_blank" href="#" title="rss">rss</a>
			        
						<a class="mail" target="_blank" href="/liduanwei1988@gmail.com" title="mail">mail</a>
			        
						<a class="facebook" target="_blank" href="#" title="facebook">facebook</a>
			        
						<a class="google" target="_blank" href="#" title="google">google</a>
			        
						<a class="twitter" target="_blank" href="#" title="twitter">twitter</a>
			        
				</div>
			</nav>
		</header>				
	</div>
</nav>

      <div class="body-wrap">
        <article id="post-技术总监和CTO的区别-浅谈CTO的作用" class="article article-type-post" itemscope itemprop="blogPost">
  <div class="article-inner">
    
      <input type="hidden" class="isFancy" />
    
    
      <header class="article-header">
        
  
    <h1 class="article-title" itemprop="name">
      技术总监和CTO的区别 浅谈CTO的作用
    </h1>
  

      </header>
    
    <div class="article-entry" itemprop="articleBody">
      
        <p>&#x6211;&#x4E00;&#x76F4;&#x5728;&#x601D;&#x8003;&#x8F6F;&#x4EF6;&#x516C;&#x53F8;&#x5982;&#x4F55;&#x5F00;&#x6E90;&#x8282;&#x6D41;&#x3002;</p>
<p>&#x5F53;&#x7136;&#xFF0C;&#x8001;&#x677F;&#x4E5F;&#x5728;&#x601D;&#x8003;&#x5F00;&#x6E90;&#x8282;&#x6D41;&#x3002;</p>
<p>&#x5F53;&#x7136;&#xFF0C;&#x8001;&#x677F;&#x601D;&#x8003;&#x7684;&#x5F00;&#x6E90;&#x8282;&#x6D41;&#x5728;&#x516C;&#x53F8;&#x8FD0;&#x8425;&#x5C42;&#x9762;&#x4E0A;&#xFF0C;&#x800C;&#x6211;&#x4F5C;&#x4E3A;CTO&#xFF0C;&#x6211;&#x8003;&#x8651;&#x7684;&#x5219;&#x662F;&#x5728;&#x4EA7;&#x54C1;&#x8FD0;&#x8425;&#x89D2;&#x5EA6;&#x4E0A;&#x6765;&#x601D;&#x8003;&#x8FD9;&#x4E2A;&#x95EE;&#x9898;&#x3002;&#x5426;&#x5219;&#xFF0C;&#x4E00;&#x4E2A;&#x8F6F;&#x4EF6;&#x516C;&#x53F8;&#xFF0C;&#x5B83;&#x7684;&#x751F;&#x5B58;&#x4E0E;&#x53D1;&#x5C55;&#x5C31;&#x662F;&#x9760;&#x8F6F;&#x4EF6;&#x4EA7;&#x54C1;&#xFF0C;&#x9664;&#x6B64;&#x4E4B;&#x5916;&#x6CA1;&#x6709;&#x522B;&#x7684;&#x6536;&#x5165;&#x6765;&#x6E90;&#xFF0C;&#x90A3;&#x4E48;&#x4F5C;&#x4E3A;&#x8D1F;&#x8D23;&#x4EA7;&#x54C1;&#x7684;&#x4EBA;&#x518D;&#x89C9;&#x5F97;&#x6CA1;&#x6709;&#x8D23;&#x4EFB;&#x601D;&#x8003;&#x8FD9;&#x4E2A;&#x5173;&#x4E4E;&#x516C;&#x53F8;&#x76C8;&#x5229;&#x4E0E;&#x53D1;&#x5C55;&#x7684;&#x95EE;&#x9898;&#xFF0C;&#x90A3;&#x4E48;&#x8981;&#x628A;&#x8FD9;&#x4E2A;&#x95EE;&#x9898;&#x7529;&#x7ED9;&#x5929;&#x5929;&#x5FD9;&#x9500;&#x552E;&#x5FD9;&#x8D44;&#x91D1;&#x5FD9;&#x516C;&#x53F8;&#x7BA1;&#x7406;&#x7684;&#x8001;&#x677F;&#x4E48;&#xFF1F;&#x90A3;&#x8981;&#x4F60;&#x8FD9;&#x4E2A;CTO&#x5E72;&#x5417;&#xFF1F;&#x96BE;&#x9053;&#x5C31;&#x662F;&#x4E3A;&#x4E86;&#x8BA9;&#x4F60;&#x5F53;&#x4E2A;&#x5DE5;&#x5934;&#x7BA1;&#x4F4F;&#x4E00;&#x5E2E;&#x4EBA;&#x4E48;&#xFF1F;</p>
<p>&#x6709;&#x7684;&#x516C;&#x53F8;&#x5149;&#x6709;&#x6280;&#x672F;&#x603B;&#x76D1;&#xFF0C;&#x6CA1;&#x6709;CTO&#x3002;&#x6280;&#x672F;&#x4E86;&#x5F97;&#xFF0C;&#x4F46;&#x548C;&#x516C;&#x53F8;&#x6218;&#x7565;&#x53D1;&#x5C55;&#x4E0D;&#x8D34;&#x8EAB;&#xFF0C;&#x5149;&#x6709;&#x6280;&#x672F;&#x53D1;&#x6325;&#x4E0D;&#x4E86;&#xFF0C;&#x516C;&#x53F8;&#x7684;&#x4E1A;&#x52A1;&#x53D1;&#x5C55;&#x4E5F;&#x6CBE;&#x4E0D;&#x4E0A;&#x4ED6;&#x7684;&#x6280;&#x672F;&#x7684;&#x5149;&#x3002;&#x539F;&#x56E0;&#x5C31;&#x662F;&#x6280;&#x672F;&#x603B;&#x76D1;&#x5728;&#x601D;&#x8003;&#x4EA7;&#x54C1;&#xFF0C;&#x5374;&#x6CA1;&#x6709;&#x601D;&#x8003;&#x4EA7;&#x54C1;&#x548C;&#x516C;&#x53F8;&#x6218;&#x7565;&#x53D1;&#x5C55;&#x7684;&#x7ED3;&#x5408;&#x3002;</p>
<p>&#x800C;&#x4E14;&#xFF0C;&#x4E00;&#x4E2A;&#x4EA7;&#x54C1;&#x8981;&#x60F3;&#x6210;&#x529F;&#xFF0C;&#x9500;&#x552E;&#x80FD;&#x652F;&#x6491;&#x548C;&#x53D1;&#x5C55;&#x4E00;&#x4E2A;&#x516C;&#x53F8;&#xFF0C;&#x662F;&#x5F88;&#x96BE;&#x7684;&#x3002;&#x4E0D;&#x662F;&#x4F60;&#x505A;&#x51FA;&#x4E00;&#x4E2A;&#x4EA7;&#x54C1;&#x5C31;&#x80FD;&#x6210;&#x529F;&#x3002;&#x800C;&#x4E14;&#x4EA7;&#x54C1;&#x4E5F;&#x4E0D;&#x662F;&#x4E00;&#x4E2A;&#x72EC;&#x7ACB;&#x7684;&#x4E1C;&#x897F;&#xFF0C;&#x5B83;&#x7684;&#x6210;&#x529F;&#x8981;&#x5173;&#x8054;&#x8BB8;&#x591A;&#x4EBA;&#x3002;</p>
<p>&#x9996;&#x5148;&#xFF0C;&#x4F60;&#x4E0D;&#x7406;&#x89E3;&#x8001;&#x677F;&#x7684;&#x53D1;&#x5C55;&#x6218;&#x7565;(&#x9996;&#x5148;&#x8001;&#x677F;&#x5F97;&#x559C;&#x6B22;&#x4F60;&#x3002;&#x559C;&#x6B22;&#x4E00;&#x4E2A;&#x4EBA;&#xFF0C;&#x6709;&#x6027;&#x683C;&#x813E;&#x6C14;&#x5BF9;&#x8DEF;&#x7684;&#x539F;&#x56E0;&#xFF0C;&#x4E5F;&#x6709;&#x4F60;&#x7684;&#x6C14;&#x8D28;&#x548C;&#x7BA1;&#x7406;&#x80FD;&#x529B;&#x548C;&#x773C;&#x5149;&#x548C;&#x52C7;&#x6C14;&#x548C;&#x51B3;&#x5FC3;&#x548C;&#x5A01;&#x4FE1;&#x539F;&#x56E0;&#xFF0C;&#x4E5F;&#x6709;&#x4F60;&#x5FE0;&#x4E8E;&#x8001;&#x677F;&#x7684;&#x539F;&#x56E0;&#x3002;&#x4E00;&#x4E2A;&#x8001;&#x677F;&#x89C9;&#x5F97;&#x4E0D;&#x653E;&#x5FC3;&#x4E0D;&#x559C;&#x6B22;&#x7684;&#x4EBA;&#xFF0C;&#x5149;&#x6709;&#x80FD;&#x529B;&#x662F;&#x4E0D;&#x884C;&#x7684;&#xFF0C;&#x662F;&#x8FDF;&#x65E9;&#x88AB;&#x8001;&#x677F;Kill&#x7684;&#x4EBA;&#xFF0C;&#x5F53;&#x7136;&#x8001;&#x677F;&#x4E5F;&#x4E0D;&#x4F1A;&#x8BA9;&#x4F60;&#x77E5;&#x9053;&#x4ED6;&#x5728;&#x60F3;&#x4EC0;&#x4E48;&#x3002;&#x4F60;&#x8FDE;&#x8001;&#x677F;&#x5728;&#x60F3;&#x4EC0;&#x4E48;&#x90FD;&#x4E0D;&#x77E5;&#x6653;&#xFF0C;&#x5982;&#x4F55;&#x505A;&#x548C;&#x8001;&#x677F;&#x60F3;&#x6CD5;&#x8D34;&#x5207;&#x7684;&#x4EA7;&#x54C1;&#x5462;&#xFF1F;&#x8FD9;&#x4E5F;&#x662F;&#x5F88;&#x591A;&#x6280;&#x672F;&#x603B;&#x76D1;&#x548C;CTO&#x8FDE;&#x5934;&#x90FD;&#x6CA1;&#x5F00;&#x5C31;&#x8EAB;&#x5148;&#x6B7B;&#x7684;&#x539F;&#x56E0;&#xFF0C;&#x66F4;&#x522B;&#x8BF4;&#x8FD0;&#x8425;&#x4E00;&#x4E2A;&#x6210;&#x529F;&#x7684;&#x4EA7;&#x54C1;&#x3002;&#x8FD9;&#x4E2A;&#x8BDD;&#x9898;&#x867D;&#x7136;&#x8BA9;&#x5F88;&#x591A;&#x5D07;&#x5C1A;&#x804C;&#x4E1A;&#x7BA1;&#x7406;&#x7684;&#x4EBA;&#x4E0D;&#x5C51;&#x4E00;&#x987E;&#xFF0C;&#x4F46;&#x73B0;&#x5B9E;&#x5C31;&#x662F;&#x5982;&#x6B64;&#x3002;&#x8981;&#x4E48;&#x4F60;&#x6000;&#x7740;&#x624D;&#x7B49;&#x4E2D;&#x56FD;&#x53D8;&#x6210;&#x804C;&#x4E1A;&#x6C11;&#x4E3B;&#x56FD;&#x5EA6;&#xFF0C;&#x8981;&#x4E48;&#x4F60;&#x73B0;&#x5728;&#x5C31;&#x52A8;&#x624B;&#x505A;&#x3002;&#x6210;&#x529F;&#x7684;&#x4EBA;&#x90FD;&#x662F;&#x5728;&#x4E0D;&#x53EF;&#x80FD;&#x5B8C;&#x6210;&#x7684;&#x60C5;&#x51B5;&#x4E0B;&#x5B8C;&#x6210;&#x7684;&#x3002;&#x5982;&#x679C;&#x90FD;&#x662F;&#x4E07;&#x4E8B;&#x4FF1;&#x5907;&#xFF0C;&#x90A3;&#x8001;&#x677F;&#x8981;&#x4F60;&#x548C;&#x8981;&#x522B;&#x4EBA;&#x6709;&#x4EC0;&#x4E48;&#x4E24;&#x6837;&#x5462;&#xFF1F;)&#xFF0C;&#x8FDE;&#x5236;&#x9020;&#x4E00;&#x4E2A;&#x4EA7;&#x54C1;&#x7684;&#x673A;&#x4F1A;&#x90FD;&#x6CA1;&#x6709;&#xFF0C;&#x66F4;&#x522B;&#x8BF4;&#x7ED9;&#x4F60;&#x4EBA;&#x529B;&#x8D44;&#x6E90;&#x548C;&#x7814;&#x7A76;&#x7684;&#x65F6;&#x95F4;&#x8D44;&#x6E90;&#x548C;&#x6280;&#x672F;&#x57F9;&#x8BAD;&#x8D44;&#x6E90;&#x3002;</p>
<p>&#x4F60;&#x5373;&#x4F7F;&#x7406;&#x89E3;&#x4E86;&#xFF0C;&#x4F60;&#x8FD8;&#x5F97;&#x60F3;&#x51FA;&#x4E0E;&#x4E4B;&#x5339;&#x914D;&#x7684;&#x4EA7;&#x54C1;&#x3002;&#x8FD9;&#x662F;&#x66F4;&#x96BE;&#x7684;&#x7B2C;&#x4E8C;&#x6B65;&#x3002;</p>
<p>&#x4F46;&#x4E0D;&#x8981;&#x4EE5;&#x4E3A;&#x4E00;&#x4E2A;&#x597D;&#x7684;&#x60F3;&#x6CD5;&#x5C31;&#x80FD;&#x6210;&#x529F;&#x3002;&#x4F60;&#x9700;&#x8981;&#x7EC4;&#x7EC7;&#x4F60;&#x7684;&#x4EBA;&#x529B;&#x8D44;&#x6E90;&#x6765;&#x6267;&#x884C;&#x843D;&#x5730;&#x5B9E;&#x73B0;&#x3002;&#x4E00;&#x4E2A;&#x516C;&#x53F8;&#x6240;&#x5904;&#x7684;&#x56F0;&#x5883;&#x90FD;&#x662F;&#x5404;&#x6709;&#x5404;&#x7684;&#x4E0D;&#x540C;&#x3002;&#x6CA1;&#x6709;&#x6625;&#x98CE;&#x5F97;&#x610F;&#x8BA9;&#x4F60;&#x968F;&#x7406;&#x60F3;&#x8C03;&#x5EA6;&#x8D44;&#x6E90;&#x7684;&#x516C;&#x53F8;&#x3002;&#x8001;&#x677F;&#x7ED9;&#x4F60;&#x7684;&#x8D44;&#x6E90;&#xFF0C;&#x6C38;&#x8FDC;&#x5C0F;&#x4E8E;&#x4F60;&#x5E72;&#x4E8B;&#x9700;&#x8981;&#x7684;&#x8D44;&#x6E90;&#x3002;&#x8FD9;&#x5C31;&#x662F;&#x73B0;&#x5B9E;&#x3002;</p>
<p>&#x9996;&#x5148;&#x5C31;&#x662F;&#x4EBA;&#x529B;&#x8D44;&#x6E90;&#xFF0C;&#x5C31;&#x8FD9;&#x4E48;&#x591A;&#x4EBA;&#xFF0C;&#x8FD9;&#x4E9B;&#x4EBA;&#x7684;&#x7D20;&#x8D28;&#x3002;&#x6240;&#x4EE5;&#xFF0C;&#x4F60;&#x7684;&#x8BBE;&#x60F3;&#xFF0C;&#x4E0D;&#x4EC5;&#x8981;&#x548C;&#x516C;&#x53F8;&#x6218;&#x7565;&#x5339;&#x914D;&#xFF0C;&#x800C;&#x4E14;&#x8FD8;&#x8981;&#x548C;&#x516C;&#x53F8;&#x73B0;&#x72B6;&#x5339;&#x914D;&#xFF0C;&#x627E;&#x597D;&#x5E73;&#x8861;&#x70B9;&#x5F88;&#x4E0D;&#x5BB9;&#x6613;&#x3002;</p>
<p>&#x8FD9;&#x4E48;&#x591A;&#x4E0D;&#x5BB9;&#x6613;&#x8FD8;&#x4E0D;&#x7B97;&#x3002;&#x4F60;&#x4E24;&#x4E2A;&#x90FD;&#x8003;&#x8651;&#x5230;&#x4E86;&#xFF0C;&#x5C31;&#x662F;&#x6CA1;&#x8003;&#x8651;&#x5230;&#x5BA2;&#x6237;&#x884C;&#x4E1A;&#x7684;&#x73B0;&#x72B6;&#x3001;&#x6311;&#x6218;&#x3001;&#x673A;&#x9047;&#x3001;&#x56F0;&#x5883;&#x548C;&#x5BA2;&#x6237;&#x884C;&#x4E1A;&#x672A;&#x6765;3-5&#x5E74;&#x7684;&#x53D8;&#x5316;&#xFF0C;&#x90A3;&#x4E48;&#x4F60;&#x7684;&#x4EA7;&#x54C1;&#x53EF;&#x80FD;&#x7B26;&#x5408;&#x8001;&#x677F;&#x7684;&#x60F3;&#x6CD5;&#xFF0C;&#x4F46;&#x5C31;&#x662F;&#x5356;&#x4E0D;&#x51FA;&#x53BB;&#xFF08;&#x8001;&#x677F;&#x6709;&#x7406;&#x60F3;&#x6709;&#x68A6;&#x60F3;&#xFF0C;&#x4F46;&#x672A;&#x5FC5;&#x8001;&#x677F;&#x7684;&#x7406;&#x60F3;&#x548C;&#x68A6;&#x60F3;&#x80FD;&#x548C;&#x5BA2;&#x6237;&#x7684;&#x53D1;&#x5C55;&#x540C;&#x6B65;&#xFF09;&#xFF0C;&#x8001;&#x677F;&#x95EE;&#x7F6A;&#x7684;&#x53EF;&#x662F;&#x4F60;&#x3002;</p>
<p>&#x4EBA;&#x5F52;&#x4F60;&#x7BA1;&#x4E86;&#xFF0C;&#x4EBA;&#x4E5F;&#x5C31;&#x8FD9;&#x6837;&#x4E86;&#xFF0C;&#x77ED;&#x671F;&#x5185;&#x63D0;&#x9AD8;&#x548C;&#x626D;&#x8F6C;&#x662F;&#x4E0D;&#x53EF;&#x80FD;&#x7684;&#x3002;&#x4E8E;&#x662F;&#xFF0C;&#x5FC5;&#x987B;&#x5F00;&#x59CB;&#x3002;&#x4F46;&#x662F;&#x6BCF;&#x4E2A;&#x4EBA;&#x7684;&#x60F3;&#x6CD5;&#x662F;&#x5426;&#x80FD;&#x7EDF;&#x4E00;&#x4E00;&#x81F4;&#x671D;&#x7740;&#x4F60;&#x7684;&#x76EE;&#x6807;&#x8D70;&#xFF0C;&#x6BCF;&#x4E2A;&#x4EBA;&#x7684;&#x914D;&#x5408;&#x8D77;&#x6765;&#x7684;&#x7D20;&#x8D28;&#x662F;&#x5426;&#x80FD;&#x8FBE;&#x5230;&#x4F60;&#x7684;&#x8981;&#x6C42;&#xFF0C;&#x5FEB;&#x8FDB;&#x4E86;&#x4E5F;&#x4E0D;&#x884C;&#xFF0C;&#x63A8;&#x51FA;&#x65E9;&#x4E86;&#x662F;&#x5148;&#x70C8;&#xFF0C;&#x800C;&#x4E14;&#x5F88;&#x6709;&#x53EF;&#x80FD;&#x90FD;&#x63A8;&#x4E0D;&#x51FA;&#x6765;&#xFF0C;&#x56E0;&#x4E3A;&#x81EA;&#x5DF1;&#x5185;&#x90E8;&#x4E71;&#x4E86;&#x9635;&#x811A;&#x4E86;&#x3002;&#x6162;&#x4E86;&#x4E5F;&#x4E0D;&#x884C;&#xFF0C;&#x4EBA;&#x5BB6;&#x90FD;&#x5728;&#x70ED;&#x5356;&#x4E86;&#xFF0C;&#x4F60;&#x60F3;&#x7092;&#x4E2A;&#x70ED;&#x70B9;&#x7A81;&#x51FA;&#x4F60;&#xFF0C;&#x4E0D;&#x5BB9;&#x6613;&#x3002;</p>
<p>&#x4EBA;&#x4E5F;&#x662F;&#x6709;&#x75B2;&#x52B3;&#x671F;&#x7684;&#xFF0C;&#x4EBA;&#x4E5F;&#x6709;&#x53D1;&#x813E;&#x6C14;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x4EBA;&#x7684;&#x7CBE;&#x795E;&#x60F0;&#x6027;&#x4E5F;&#x5F88;&#x5927;&#xFF0C;&#x4EBA;&#x7684;&#x6027;&#x683C;&#x4E5F;&#x4E0D;&#x540C;&#x3002;&#x4F60;&#x5982;&#x4F55;&#x7ED9;&#x8FD9;&#x652F;&#x961F;&#x4F0D;&#x8FDB;&#x884C;&#x6301;&#x7EED;&#x7684;&#x6D47;&#x82B1;&#x65BD;&#x80A5;&#x4FEE;&#x526A;&#x679D;&#x4E2B;&#x9632;&#x866B;&#x9632;&#x5BB3;&#xFF0C;&#x6709;&#x65F6;&#x8FD8;&#x8981;&#x6652;&#x6652;&#x592A;&#x9633;&#x89C1;&#x89C1;&#x98CE;&#xFF0C;&#x6709;&#x65F6;&#x8FD8;&#x8981;&#x642C;&#x5230;&#x9634;&#x51C9;&#x5730;&#x513F;&#xFF0C;&#x90FD;&#x9700;&#x8981;&#x4E0D;&#x65F6;&#x770B;&#x770B;&#x8FD9;&#x652F;&#x961F;&#x4F0D;&#x662F;&#x5426;&#x6709;&#x574F;&#x8FF9;&#x8C61;&#x3002;</p>
<p>&#x4EA7;&#x54C1;&#x662F;&#x8D39;&#x4E86;&#x52B2;&#x505A;&#x4E86;&#x51FA;&#x6765;&#xFF0C;&#x516C;&#x53F8;&#x7684;&#x5176;&#x4ED6;&#x90E8;&#x95E8;&#x4E0D;&#x77E5;&#x9053;&#x600E;&#x4E48;&#x63A8;&#x5E7F;&#x600E;&#x4E48;&#x9500;&#x552E;&#x600E;&#x4E48;&#x5B9E;&#x65BD;&#x600E;&#x4E48;&#x54A8;&#x8BE2;&#x600E;&#x4E48;&#x652F;&#x6301;&#x3002;&#x68A6;&#x60F3;&#x7740;&#x9760;&#x6D41;&#x7A0B;&#x6765;&#x63A8;&#x884C;&#xFF0C;&#x81EA;&#x8A00;&#x81EA;&#x8BED;&#x8BF4;&#x53CD;&#x6B63;&#x5F00;&#x53D1;&#x4EA7;&#x54C1;&#x662F;&#x6211;&#x7814;&#x53D1;&#x7684;&#x4E8B;&#x60C5;&#xFF0C;&#x80FD;&#x4E0D;&#x80FD;&#x63A8;&#x5E7F;&#x5C31;&#x662F;&#x4F60;&#x5E02;&#x573A;&#x90E8;&#x7684;&#x4E8B;&#x60C5;&#x4E86;&#xFF0C;&#x8FD9;&#x6837;&#x8BF4;&#x7EAF;&#x7CB9;&#x662F;&#x6B3A;&#x9A97;&#x81EA;&#x5DF1;&#x3002;&#x8FD9;&#x6837;&#xFF0C;&#x5F88;&#x5BB9;&#x6613;&#x4EA7;&#x54C1;&#x8FDE;&#x7814;&#x53D1;&#x90E8;&#x90FD;&#x51FA;&#x4E0D;&#x53BB;&#xFF0C;&#x618B;&#x6B7B;&#x5728;&#x5185;&#x90E8;&#x4E86;&#x3002;&#x4F60;&#x4E00;&#x70B9;&#x6210;&#x5C31;&#x611F;&#x6CA1;&#x6709;&#xFF0C;&#x5F53;&#x7136;&#xFF0C;&#x4F60;&#x7684;&#x7269;&#x8D28;&#x5956;&#x52B1;&#x4E5F;&#x662F;&#x6CA1;&#x6709;&#x7684;&#xFF0C;&#x8FD8;&#x5F88;&#x6709;&#x53EF;&#x80FD;&#x4F60;&#x8BE5;&#x804C;&#x4E1A;&#x7ECF;&#x7406;&#x4EBA;&#x8DD1;&#x8DEF;&#x4E86;&#x3002;&#x6240;&#x4EE5;&#xFF0C;&#x5FC5;&#x987B;&#x6709;CTO&#xFF0C;&#x51CC;&#x9A7E;&#x4E8E;&#x6280;&#x672F;&#x603B;&#x76D1;&#x4E4B;&#x4E0A;&#xFF0C;&#x7EDF;&#x7BA1;&#x4F01;&#x4E1A;&#x54A8;&#x8BE2;&#x5B9E;&#x65BD;&#x652F;&#x6301;&#xFF0C;&#x800C;&#x534F;&#x8C03;&#x5E02;&#x573A;&#x4E0E;&#x9500;&#x552E;&#x3002;</p>
<p>&#x4F20;&#x9012;&#x662F;&#x4F1A;&#x5931;&#x771F;&#x7684;&#xFF0C;&#x5C24;&#x5176;&#x662F;&#x4E00;&#x4E2A;&#x9700;&#x8981;&#x8D39;&#x597D;&#x5927;&#x52B2;&#x624D;&#x80FD;&#x8BF4;&#x660E;&#x767D;&#x7684;&#x7BA1;&#x7406;&#x7406;&#x5FF5;&#x3002;&#x4E8E;&#x662F;&#x4F60;&#x7406;&#x89E3;100%&#xFF0C;&#x7814;&#x53D1;&#x4EBA;&#x5458;&#x7406;&#x89E3;70%&#xFF0C;&#x843D;&#x5B9E;&#x5230;&#x4EA7;&#x54C1;&#x4E0A;&#xFF0C;&#x843D;&#x5B9E;&#x4E86;50%&#xFF0C;&#x4F20;&#x9012;&#x5230;&#x5E02;&#x573A;&#xFF0C;&#x6210;&#x4E86;30%&#xFF0C;&#x5230;&#x4E86;&#x5B9E;&#x65BD;&#xFF0C;&#x6210;&#x4E86;20%&#xFF0C;&#x5230;&#x4E86;&#x5BA2;&#x6237;&#x90A3;&#x91CC;&#xFF0C;&#x5BA2;&#x6237;&#x53EA;&#x5438;&#x6536;10%&#x3002;&#x6240;&#x4EE5;&#xFF0C;&#x4E00;&#x4E2A;&#x704C;&#x6CE8;&#x4E86;&#x597D;&#x7684;&#x7BA1;&#x7406;&#x7406;&#x5FF5;&#x7684;&#x7BA1;&#x7406;&#x8F6F;&#x4EF6;&#xFF0C;&#x5BA2;&#x6237;&#x53EA;&#x80FD;&#x63A5;&#x6536;10%&#x7684;&#x597D;&#x5904;&#x3002;&#x6240;&#x4EE5;&#xFF0C;&#x7BA1;&#x7406;&#x8F6F;&#x4EF6;&#x5BA2;&#x6237;&#x8BA4;&#x4E3A;&#x5DEE;&#x4E0D;&#x591A;&#x5C31;&#x662F;&#x4E2A;600&#x5757;&#x94B1;&#xFF0C;&#x9AD8;&#x7EA7;&#x70B9;&#x7684;&#x7535;&#x5B50;&#x8868;&#x683C;&#x800C;&#x5DF2;&#x3002;&#x5C24;&#x5176;&#x968F;&#x7740;&#x5BA2;&#x6237;&#x4EBA;&#x5458;&#x7684;&#x6D41;&#x5931;&#x548C;&#x66F4;&#x66FF;&#xFF0C;&#x968F;&#x7740;&#x8F6F;&#x4EF6;&#x516C;&#x53F8;&#x4EBA;&#x5458;&#x7684;&#x6D41;&#x5931;&#x548C;&#x66F4;&#x66FF;&#xFF0C;&#x6700;&#x540E;&#x5565;&#x90FD;&#x5269;&#x4E0D;&#x4E0B;&#xFF0C;&#x8F6F;&#x4EF6;&#x80FD;&#x5C55;&#x793A;&#x7ED9;&#x5BA2;&#x6237;&#x7684;&#x597D;&#x5904;&#xFF0C;&#x771F;&#x662F;&#x4E00;&#x70B9;&#x597D;&#x5904;&#x90FD;&#x8BF4;&#x4E0D;&#x51FA;&#x6765;&#x4E86;&#x3002;</p>

      
    </div>
    <div class="article-info article-info-index">
      
      <a href="/2016/11/01/技术总监和CTO的区别-浅谈CTO的作用/" class="archive-article-date">
  	<time datetime="2016-11-01T08:45:04.000Z" itemprop="datePublished"><i class="icon-clock"></i>2016-11-01</time>
</a>
      
	<div class="article-tag tagcloud">
		<i class="icon-price-tags"></i>
		<ul class="article-tag-list"><li class="article-tag-list-item"><a class="article-tag-list-link" href="/tags/CTO/">CTO</a></li><li class="article-tag-list-item"><a class="article-tag-list-link" href="/tags/感悟/">感悟</a></li><li class="article-tag-list-item"><a class="article-tag-list-link" href="/tags/技术总监/">技术总监</a></li><li class="article-tag-list-item"><a class="article-tag-list-link" href="/tags/生活/">生活</a></li><li class="article-tag-list-item"><a class="article-tag-list-link" href="/tags/随笔/">随笔</a></li></ul>
	</div>

      

      <div class="clearfix"></div>
    </div>
  </div>
</article>

  
<nav id="article-nav">
  
  
    <a href="/2016/10/26/玩转单元测试之-Testing-Spring-MVC-Controllers/" id="article-nav-older" class="article-nav-link-wrap">
      <div class="article-nav-title">玩转单元测试之 Testing Spring MVC Controllers</div>
      <i class="icon-circle-right"></i>
    </a>
  
</nav>




<div class="share_jia">
	<!-- JiaThis Button BEGIN -->
	<div class="jiathis_style">
		<span class="jiathis_txt">Share to: &nbsp; </span>
		<a class="jiathis_button_facebook"></a> 
	    <a class="jiathis_button_twitter"></a>
	    <a class="jiathis_button_plus"></a> 
	    <a class="jiathis_button_tsina"></a>
		<a class="jiathis_button_cqq"></a>
		<a class="jiathis_button_douban"></a>
		<a class="jiathis_button_weixin"></a>
		<a class="jiathis_button_tumblr"></a>
    <a href="http://www.jiathis.com/share" class="jiathis jiathis_txt jtico jtico_jiathis" target="_blank"></a>
	</div>
	<script type="text/javascript" src="//v3.jiathis.com/code/jia.js?uid=1405949716054953" charset="utf-8"></script>
	<!-- JiaThis Button END -->
</div>






<div class="duoshuo">
	<!-- 多说评论框 start -->
	<div class="ds-thread" data-thread-key="技术总监和CTO的区别-浅谈CTO的作用" data-title="技术总监和CTO的区别 浅谈CTO的作用" data-url="http://www.liduanwei.com/2016/11/01/技术总监和CTO的区别-浅谈CTO的作用/"></div>
	<!-- 多说评论框 end -->
	<!-- 多说公共JS代码 start (一个网页只需插入一次) -->
	<script type="text/javascript">
	var duoshuoQuery = {short_name:"liduanwei"};
	(function() {
		var ds = document.createElement('script');
		ds.type = 'text/javascript';ds.async = true;
		ds.src = (document.location.protocol == 'https:' ? 'https:' : 'http:') + '//static.duoshuo.com/embed.js';
		ds.charset = 'UTF-8';
		(document.getElementsByTagName('head')[0] 
		 || document.getElementsByTagName('body')[0]).appendChild(ds);
	})();
	</script>
	<!-- 多说公共JS代码 end -->
</div>





      </div>
      <footer id="footer">
  <div class="outer">
    <div id="footer-info">
    	<div class="footer-left">
    		&copy; 2016 Welee
    	</div>
      	<div class="footer-right">
      		<a href="http://hexo.io/" target="_blank">Hexo</a>  Theme <a href="https://github.com/litten/hexo-theme-yilia" target="_blank">Yilia</a> by Litten
      	</div>
    </div>
  </div>
</footer>
    </div>
    <script>
	var yiliaConfig = {
		fancybox: true,
		mathjax: false,
		animate: true,
		isHome: false,
		isPost: true,
		isArchive: false,
		isTag: false,
		isCategory: false,
		open_in_new: false,
		root: "/",
		innerArchive: true
	}
</script>

<script src="/./main.js"></script>


    
<div class="tools-col">
  <ul class="btn-wrap">
    
      <li class="chose" data-hook="tools-section-all"><span class="text">全部</span><i class="icon-book"></i></li>
    
    
      <li data-hook="tools-section-tag"><span class="text">标签</span><i class="icon-price-tags"></i></li>
    
    
      <li data-hook="tools-section-friends"><span class="text">友链</span><i class="icon-link"></i></li>
    
    
      <li data-hook="tools-section-me"><span class="text">我</span><i class="icon-smile"></i></li>
    
  </ul>
  <div class="tools-wrap">
    
    	<section class="tools-section tools-section-all chose">
    	</section>
    

    
    	<section class="tools-section tools-section-tag">
    			<div class="widget tagcloud" id="js-tagcloud">
    				<a href="/tags/AngularJS/" style="font-size: 10px;">AngularJS</a> <a href="/tags/CTO/" style="font-size: 10px;">CTO</a> <a href="/tags/Compiler/" style="font-size: 10px;">Compiler</a> <a href="/tags/Dubbo/" style="font-size: 10px;">Dubbo</a> <a href="/tags/Java/" style="font-size: 20px;">Java</a> <a href="/tags/Javaassit/" style="font-size: 10px;">Javaassit</a> <a href="/tags/Junit/" style="font-size: 10px;">Junit</a> <a href="/tags/MVVM/" style="font-size: 10px;">MVVM</a> <a href="/tags/Mock/" style="font-size: 10px;">Mock</a> <a href="/tags/Nginx/" style="font-size: 13.33px;">Nginx</a> <a href="/tags/ORM/" style="font-size: 10px;">ORM</a> <a href="/tags/Spring/" style="font-size: 10px;">Spring</a> <a href="/tags/SpringMVC/" style="font-size: 13.33px;">SpringMVC</a> <a href="/tags/Tengine/" style="font-size: 10px;">Tengine</a> <a href="/tags/Tomcat/" style="font-size: 10px;">Tomcat</a> <a href="/tags/Web/" style="font-size: 10px;">Web</a> <a href="/tags/Zookeeper/" style="font-size: 10px;">Zookeeper</a> <a href="/tags/error/" style="font-size: 10px;">error</a> <a href="/tags/git/" style="font-size: 13.33px;">git</a> <a href="/tags/hook/" style="font-size: 10px;">hook</a> <a href="/tags/hooks/" style="font-size: 10px;">hooks</a> <a href="/tags/post-receive/" style="font-size: 10px;">post-receive</a> <a href="/tags/post-update/" style="font-size: 10px;">post-update</a> <a href="/tags/test/" style="font-size: 10px;">test</a> <a href="/tags/web框架/" style="font-size: 10px;">web框架</a> <a href="/tags/代码库/" style="font-size: 10px;">代码库</a> <a href="/tags/分布式/" style="font-size: 13.33px;">分布式</a> <a href="/tags/前端/" style="font-size: 13.33px;">前端</a> <a href="/tags/动态代理/" style="font-size: 10px;">动态代理</a> <a href="/tags/单元测试/" style="font-size: 10px;">单元测试</a> <a href="/tags/原理/" style="font-size: 10px;">原理</a> <a href="/tags/双向绑定/" style="font-size: 10px;">双向绑定</a> <a href="/tags/反向代理/" style="font-size: 10px;">反向代理</a> <a href="/tags/字节码/" style="font-size: 10px;">字节码</a> <a href="/tags/安全/" style="font-size: 10px;">安全</a> <a href="/tags/实用/" style="font-size: 10px;">实用</a> <a href="/tags/小技巧/" style="font-size: 10px;">小技巧</a> <a href="/tags/常见问题/" style="font-size: 13.33px;">常见问题</a> <a href="/tags/开发书籍/" style="font-size: 10px;">开发书籍</a> <a href="/tags/开发工具/" style="font-size: 10px;">开发工具</a> <a href="/tags/开源项目/" style="font-size: 10px;">开源项目</a> <a href="/tags/感悟/" style="font-size: 16.67px;">感悟</a> <a href="/tags/感情/" style="font-size: 10px;">感情</a> <a href="/tags/感想/" style="font-size: 10px;">感想</a> <a href="/tags/技术总监/" style="font-size: 10px;">技术总监</a> <a href="/tags/服务器端/" style="font-size: 10px;">服务器端</a> <a href="/tags/机器学习/" style="font-size: 10px;">机器学习</a> <a href="/tags/框架/" style="font-size: 10px;">框架</a> <a href="/tags/源码/" style="font-size: 10px;">源码</a> <a href="/tags/生日/" style="font-size: 10px;">生日</a> <a href="/tags/生活/" style="font-size: 13.33px;">生活</a> <a href="/tags/编译器/" style="font-size: 10px;">编译器</a> <a href="/tags/自动部署/" style="font-size: 10px;">自动部署</a> <a href="/tags/负载均衡/" style="font-size: 10px;">负载均衡</a> <a href="/tags/随笔/" style="font-size: 13.33px;">随笔</a>
    			</div>
    	</section>
    

    
    	<section class="tools-section tools-section-friends">
  		
  			<div class="friends-wrap" id="js-friends">
  			
  	          <a target="_blank" class="main-nav-link switch-friends-link" href="http://blog.liduanwei.com">Welee&#39;s Blog</a>
  	        
  	        </div>
  		
    	</section>
    

    
    	<section class="tools-section tools-section-me">
  	  	
  	  		<div class="aboutme-wrap" id="js-aboutme">爱码代码,也折腾好玩的智能硬件,希望能做点什么出来影响这个世界…</div>
  	  	
    	</section>
    
  </div>
  
</div>
    <!-- Root element of PhotoSwipe. Must have class pswp. -->
<div class="pswp" tabindex="-1" role="dialog" aria-hidden="true">

    <!-- Background of PhotoSwipe. 
         It's a separate element as animating opacity is faster than rgba(). -->
    <div class="pswp__bg"></div>

    <!-- Slides wrapper with overflow:hidden. -->
    <div class="pswp__scroll-wrap">

        <!-- Container that holds slides. 
            PhotoSwipe keeps only 3 of them in the DOM to save memory.
            Don't modify these 3 pswp__item elements, data is added later on. -->
        <div class="pswp__container">
            <div class="pswp__item"></div>
            <div class="pswp__item"></div>
            <div class="pswp__item"></div>
        </div>

        <!-- Default (PhotoSwipeUI_Default) interface on top of sliding area. Can be changed. -->
        <div class="pswp__ui pswp__ui--hidden">

            <div class="pswp__top-bar">

                <!--  Controls are self-explanatory. Order can be changed. -->

                <div class="pswp__counter"></div>

                <button class="pswp__button pswp__button--close" title="Close (Esc)"></button>

                <button class="pswp__button pswp__button--share" style="display:none" title="Share"></button>

                <button class="pswp__button pswp__button--fs" title="Toggle fullscreen"></button>

                <button class="pswp__button pswp__button--zoom" title="Zoom in/out"></button>

                <!-- Preloader demo http://codepen.io/dimsemenov/pen/yyBWoR -->
                <!-- element will get class pswp__preloader--active when preloader is running -->
                <div class="pswp__preloader">
                    <div class="pswp__preloader__icn">
                      <div class="pswp__preloader__cut">
                        <div class="pswp__preloader__donut"></div>
                      </div>
                    </div>
                </div>
            </div>

            <div class="pswp__share-modal pswp__share-modal--hidden pswp__single-tap">
                <div class="pswp__share-tooltip"></div> 
            </div>

            <button class="pswp__button pswp__button--arrow--left" title="Previous (arrow left)">
            </button>

            <button class="pswp__button pswp__button--arrow--right" title="Next (arrow right)">
            </button>

            <div class="pswp__caption">
                <div class="pswp__caption__center"></div>
            </div>

        </div>

    </div>

</div>
  </div>
</body>
</html>